Revit 2024 API
KeynoteEntry Properties
The KeynoteEntry type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from KeyBasedTreeEntry.)
Key
 The key of this entry.
 (Inherited from KeyBasedTreeEntry.)
KeynoteText
 The text associated with this KeynoteEntry.
ParentKey
 The parent key of this entry.
 (Inherited from KeyBasedTreeEntry.)
See Also
KeynoteEntry Class
Autodesk.Revit.DB Namespace